<?php
return array(
	//前台地址
	'front' => '',

	//缓存过期时间5min, 10min, 30min, 2hours, 4hours
	'cacheExpire' => array('tiny'=>300, 'small'=>600, 'medium'=>1800, 'long'=>7200, 'big'=>14400, 'forever'=>0),

	//分页
	'pagination' => array(
		"pagesize" => 15,
	),

	//配置名称
	'configType' => array(
		'role'=>'role',
		'ZJLX'=>'ZJLX',
		'XL'=>'XL',
		'XYS'=>'XYS',
		'YJS'=>'YJS',
		'WLLX'=>'WLLX',
		'ZZLX'=>'ZZLX',
		'TYYY'=>'TYYY',
		'ZSYKNY'=>'ZSYKNY',
		'ZSYKNY_JL'=>'ZSYKNY_JL',
		'KFKNY'=>'KFKNY',
		'KFKNYZZ'=>'KFKNYZZ',
		'TTLYY'=>'TTLYY',
		'JYYY'=>'JYYY',
		'GMBW'=>'GMBW',
		'XX'=>'XX',
		'CYZD'=>'CYZD',
		'CYDY'=>'CYDY',
		'XSBY'=>'XSBY',
		'XSLX'=>'XSLX',
		'XS'=>'XS',
		'XGN'=>'XGN',
		'KILLIP'=>'KILLIP',
		'XGBW'=>'XGBW',
		'XGLX'=>'XGLX',
		'SPLX'=>'SPLX',
		'ZRQBQYY'=>'ZRQBQYY',
		'QBQLX'=>'QBQLX',
		'SWFS'=>'SWFS',
		'ZZSS'=>'ZZSS',
		'HOSPITAL'=>'HOSPITAL',
	),
	// 角色
	'role' => array(
		'0' => '超级管理员',
		'1' => '管理员',
		'2' => '主任',
		'3' => '医生',
	),

	// 病例共享权限
	'permission' => array(
		'0' => '查看',
		'1' => '编辑',
		'2' => '删除',
	),

	// 菜单分组
	'group' => array(
		'0' => '总览',
		'1' => '病历管理',
		'2' => '随访管理',
		'3' => '数据分析',
		'4' => '系统管理',
	),

	// 性别
	'sex' => array(
		'1' => '女',
		'2' => '男',
	),

	//有无
	'have' => array(
		'0' => '无',
		'1' => '有',
	),

	// 是否
	'boolean' => array(
		'0' => '否',
		'1' => '是',
	),

	// 大出血 小出血
	'cx' => array(
		'0' => '大出血',
		'1' => '小出血',
	),


	// 存活 死亡
	'alive' => array(
		'0' => '存活',
		'1' => '死亡',
	),

	// 是否不详
	'notquite' => array(
		'0' => '否',
		'1' => '是',
		'2' => '不详',
	),
	// 是否用后又停
	'stop' => array(
		'0' => '否',
		'1' => '是',
		'2' => '用后又停',
	),
	// 是否如用华法林，INR值
	'fhl' => array(
		'0' => '否',
		'1' => '是',
		'2' => '如用华法林，INR值',
	),
	// 名族
	'nationality' => array(
		'汉族' => '汉族',
		'蒙古族' => '蒙古族',
		'彝族' => '彝族',
		'侗族' => '侗族',
		'哈萨克族' => '哈萨克族',
		'畲族' => '畲族',
		'纳西族' => '纳西族',
		'仫佬族' => '仫佬族',
		'仡佬族' => '仡佬族',
		'怒族' => '怒族',
		'保安族' => '保安族',
		'鄂伦春族' => '鄂伦春族',
		'回族' => '回族',
		'壮族' => '壮族',
		'瑶族' => '瑶族',
		'傣族' => '傣族',
		'高山族' => '高山族',
		'景颇族' => '景颇族',
		'羌族' => '羌族',
		'锡伯族' => '锡伯族',
		'乌孜别克族' => '乌孜别克族',
		'裕固族' => '裕固族',
		'赫哲族' => '赫哲族',
		'藏族' => '藏族',
		'布依族' => '布依族',
		'白族' => '白族',
		'黎族' => '黎族',
		'拉祜族' => '拉祜族',
		'柯尔克孜族' => '柯尔克孜族',
		'布朗族' => '布朗族',
		'阿昌族' => '阿昌族',
		'俄罗斯族' => '俄罗斯族',
		'京族' => '京族',
		'门巴族' => '门巴族',
		'维吾尔族' => '维吾尔族',
		'朝鲜族' => '朝鲜族',
		'土家族' => '土家族',
		'傈僳族' => '傈僳族',
		'水族' => '水族',
		'土族' => '土族',
		'撒拉族' => '撒拉族',
		'普米族' => '普米族',
		'鄂温克族' => '鄂温克族',
		'塔塔尔族' => '塔塔尔族',
		'珞巴族' => '珞巴族',
		'苗族' => '苗族',
		'满族' => '满族',
		'哈尼族' => '哈尼族',
		'佤族' => '佤族',
		'东乡族' => '东乡族',
		'达斡尔族' => '达斡尔族',
		'毛南族' => '毛南族',
		'塔吉克族' => '塔吉克族',
		'德昂族' => '德昂族',
		'独龙族' => '独龙族',
		'基诺族' => '基诺族',
	),















);
